Repository: ismailukman/World-National-Flag-Challenge
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: ar, fr, tr

# app_name
source: World Nation Flag Challenge
ar: العلم الوطني العالمي
fr: Drapeau national mondial
tr: Dünya Ulusal Bayrağı

# world_national_flag_challenge
source: World Nation Flag Challenge
ar: تحدي العلم الوطني العالمي
fr: Défi mondial du drapeau national
tr: Dünya Ulusal Bayrak Mücadelesi

source: Start
ar: بداية
fr: Début
tr: Başlat

source: Africa
ar: أفريقيا
fr: Afrique
tr: Afrika

source: Asia
ar: آسيا
fr: Asie
tr: Asya

source: Europe
ar: أوروبا
fr: L'Europe
tr: Avrupa

source: North America
ar: شمال امريكا
fr: Amérique du Nord
tr: Kuzey Amerika

source: Oceania
ar: أوقيانوسيا
fr: Océanie
tr: Okyanusya

source: South America
ar: جنوب امريكا
fr: Amérique du Sud
tr: Güney Amerika

source: Help
ar: مساعدة
fr: Aidez
tr: Yardım

source: This challenge requires you to select the correct country name of the national flag on current display from the options provided. Beginning with africa, play across all continents to stand a chance of getting higher points. Long press the audio icon to select music
ar: يتطلب هذا التحدي تحديد اسم الدولة الصحيح للعلم الوطني على الشاشة الحالية من الخيارات المتوفرة. بدءًا من إفريقيا ، العب عبر جميع القارات لتحظى بفرصة الحصول على نقاط أعلى. اضغط لفترة طويلة على أيقونة الصوت لتحديد الموسيقى
fr: Ce défi vous oblige à sélectionner le nom de pays correct du drapeau national sur l'affichage actuel parmi les options fournies. En commençant par l'Afrique, jouez sur tous les continents pour avoir une chance d'obtenir des points plus élevés. Appuyez longuement sur l'icône audio pour sélectionner la musique
tr: Bu meydan okuma, sunulan seçeneklerden mevcut ekranda ulusal bayrağın doğru ülke adını seçmenizi gerektirir. Afrika'dan başlayarak, daha yüksek puan alma şansına sahip olmak için tüm kıtalarda oynayın. Müzik seçmek için ses simgesine uzun basın

source: ...enjoy
ar: ...استمتع
fr: ...prendre plaisir
tr: ...Zevk almak

source: About
ar: حول
fr: À propos
tr: hakkında

source: This application is designed to ease familiarity with world national flags. World national flag challenge provides the educative and entertaining opportunity
ar: تم تصميم هذا التطبيق لتسهيل الإلمام بالأعلام الوطنية العالمية. يوفر تحدي العلم الوطني العالمي فرصة تعليمية وترفيهية
fr: Cette application est conçue pour faciliter la familiarité avec les drapeaux nationaux du monde. Le défi du drapeau national mondial offre une opportunité éducative et divertissante
tr: Bu uygulama, dünya ulusal bayrakları ile aşinalığı kolaylaştırmak için tasarlanmıştır. Dünya ulusal bayrak mücadelesi eğitici ve eğlenceli bir fırsat sunar

source: by Ismaila Lukman Enegi
ar: مصنوع بواسطة Ismaila Lukman Enegi
fr: Faite par Ismaila Lukman Enegi
tr: Yapan Ismaila Lukman Enegi

source: Nigeria
ar: نيجيريا
tr: Nijerya

source: Ok
ar: حسنا
fr: D'accord
tr: Tamam

# mascot_greeting
source: Hi! I'm Flaggy, your flag learning buddy!
ar: مرحبا! أنا فلاجي، رفيقك في تعلم الأعلام!
fr: Salut! Je suis Flaggy, votre compagnon d'apprentissage des drapeaux!
tr: Merhaba! Ben Flaggy, bayrak öğrenme arkadaşınız!

# mascot_correct
source: Great job!
ar: عمل رائع!
fr: Excellent travail!
tr: Harika iş!

# mascot_wrong
source: Keep trying!
ar: استمر في المحاولة!
fr: Continuez d'essayer!
tr: Denemeye devam et!

# mascot_quiz_complete
source: Amazing work! You learned {count} flags!
ar: عمل رائع! لقد تعلمت {count} علم!
fr: Travail incroyable! Vous avez appris {count} drapeaux!
tr: Harika bir çalışma! {count} bayrak öğrendiniz!

# achievement_first_quiz
source: First Quiz
ar: الاختبار الأول
fr: Premier Quiz
tr: İlk Quiz

# achievement_first_quiz_desc
source: Complete your first quiz
ar: أكمل اختبارك الأول
fr: Complétez votre premier quiz
tr: İlk quizinizi tamamlayın

# achievement_global_explorer
source: Global Explorer
ar: المستكشف العالمي
fr: Explorateur Mondial
tr: Küresel Kaşif

# achievement_global_explorer_desc
source: Try all 6 continents
ar: جرب جميع القارات الستة
fr: Essayez les 6 continents
tr: 6 kıtanın tümünü deneyin

# achievement_africa_expert
source: Africa Expert
ar: خبير أفريقيا
fr: Expert de l'Afrique
tr: Afrika Uzmanı

# achievement_africa_expert_desc
source: Perfect score on Africa quiz
ar: درجة كاملة في اختبار أفريقيا
fr: Score parfait au quiz sur l'Afrique
tr: Afrika quizinde mükemmel puan

# achievement_perfectionist
source: Perfectionist
ar: الكمالي
fr: Perfectionniste
tr: Mükemmeliyetçi

# achievement_perfectionist_desc
source: Get 100% correct on a quiz
ar: احصل على 100٪ صحيح في الاختبار
fr: Obtenez 100% de bonnes réponses à un quiz
tr: Bir quizde %100 doğru alın

# achievement_week_warrior
source: Week Warrior
ar: محارب الأسبوع
fr: Guerrier de la Semaine
tr: Hafta Savaşçısı

# achievement_week_warrior_desc
source: 7-day login streak
ar: سلسلة تسجيل دخول لمدة 7 أيام
fr: Série de connexion de 7 jours
tr: 7 günlük giriş serisi

# achievement_fortnight_fighter
source: Fortnight Fighter
ar: مقاتل الأسبوعين
fr: Combattant de la Quinzaine
tr: İki Hafta Savaşçısı

# achievement_fortnight_fighter_desc
source: 14-day login streak
ar: سلسلة تسجيل دخول لمدة 14 يومًا
fr: Série de connexion de 14 jours
tr: 14 günlük giriş serisi

# achievement_monthly_master
source: Monthly Master
ar: سيد الشهر
fr: Maître Mensuel
tr: Aylık Usta

# achievement_monthly_master_desc
source: 30-day login streak
ar: سلسلة تسجيل دخول لمدة 30 يومًا
fr: Série de connexion de 30 jours
tr: 30 günlük giriş serisi

# achievement_speedster
source: Speedster
ar: السريع
fr: Rapide
tr: Hızlı

# achievement_speedster_desc
source: Complete quiz in under 90 seconds
ar: أكمل الاختبار في أقل من 90 ثانية
fr: Terminez le quiz en moins de 90 secondes
tr: Quizi 90 saniyenin altında tamamlayın

# achievement_dedicated_learner
source: Dedicated Learner
ar: المتعلم المخلص
fr: Apprenant Dévoué
tr: Özverili Öğrenci

# achievement_dedicated_learner_desc
source: Complete 50 quizzes
ar: أكمل 50 اختبارًا
fr: Complétez 50 quiz
tr: 50 quiz tamamlayın

# achievement_flag_fanatic
source: Flag Fanatic
ar: مهووس الأعلام
fr: Fanatique des Drapeaux
tr: Bayrak Fanatik

# achievement_flag_fanatic_desc
source: Complete 100 quizzes
ar: أكمل 100 اختبار
fr: Complétez 100 quiz
tr: 100 quiz tamamlayın

source: Practice Mode
ar: وضع التدريب
fr: Mode Entraînement
tr: Pratik Modu

source: Daily Challenge
ar: التحدي اليومي
fr: Défi Quotidien
tr: Günlük Meydan Okuma

source: Achievements
ar: الإنجازات
fr: Succès
tr: Başarılar

source: Leaderboard
ar: لوحة المتصدرين
fr: Classement
tr: Lider Tablosu

source: Score
ar: النتيجة
tr: Puan

source: Correct
ar: صحيح
tr: Doğru

source: Wrong
ar: خطأ
fr: Incorrect
tr: Yanlış

source: High Score
ar: أعلى نتيجة
fr: Meilleur Score
tr: En Yüksek Puan

source: New High Score!!!
ar: أعلى نتيجة جديدة!!!
fr: Nouveau Meilleur Score!!!
tr: Yeni En Yüksek Puan!!!

# continue_text
source: Continue
ar: استمر
fr: Continuer
tr: Devam Et

# try_again
source: Please try again!
ar: يرجى المحاولة مرة أخرى!
fr: Veuillez réessayer!
tr: Lütfen tekrar deneyin!

# select_language
source: Select Default Language
ar: اختر اللغة الافتراضية
fr: Sélectionner la Langue par Défaut
tr: Varsayılan Dili Seçin

source: Quiz
ar: اختبار
tr: Sınav

# whichCountryFlag
source: Which country does this flag belong to?
ar: أي دولة ينتمي إليها هذا العلم؟
fr: À quel pays appartient ce drapeau?
tr: Bu bayrak hangi ülkeye ait?

source: Go Back
ar: عودة
fr: Retour
tr: Geri Dön

source: Quiz Complete!
ar: اكتمل الاختبار!
fr: Quiz Terminé!
tr: Sınav Tamamlandı!

source: Final Score
ar: النتيجة النهائية
fr: Score Final
tr: Final Puanı

source: Play Again
ar: العب مرة أخرى
fr: Rejouer
tr: Tekrar Oyna

source: Achievements Unlocked!
ar: تم فتح الإنجازات!
fr: Succès Débloqués!
tr: Başarılar Kazanıldı!
